Revit 2027 API
DividedSurface.UPatternIndent Property
The offset applied to the pattern by an integral number of grid nodes in the U-direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int UPatternIndent { get; set; }
Public Property UPatternIndent As Integer
	Get
	Set
public:
property int UPatternIndent {
	int get ();
	void set (int value);
}
member UPatternIndent : int with get, set
Property Value
Int32
See Also
Reference
DividedSurface Class
Autodesk.Revit.DB Namespace